{
  "name": "Bihar Election: The Final Countdown",
  "startNode": "q1_opening_gambit",
  "nodes": {
    "q1_opening_gambit": {
      "text": "The election is weeks away, hanging by a thread with polls showing a dead heat. Your advisors propose three distinct campaign messages to capture the undecided voter. Which strategic direction will you champion for the BJP?",
      "options": [
        {
          "text": "Focus on 'Vikas and Yuva Shakti': Launch a high-tech campaign centered on PM Modi's development agenda. Promise massive industrial investment and tech hubs to directly address youth unemployment.",
          "nextNode": "q2_factory_protest"
        },
        {
          "text": "Emphasize 'Samajik Nyay aur Suraksha': Blend development with social justice. Assure core caste constituencies about reservation policies while aggressively reminding voters of the RJD's 'Jungle Raj' to consolidate the law-and-order vote.",
          "nextNode": "q2_reservation_gaffe"
        },
        {
          "text": "Adopt a 'Pragmatic Alliances' approach: Focus less on a single message and more on empowering local coalition leaders. Delegate resources to allies like JD(U), LJP(R), and HAM(S) to run hyper-local campaigns tailored to their specific vote banks.",
          "nextNode": "q2_ally_rebellion"
        }
      ]
    },
    "q2_factory_protest": {
      "text": "Your 'Vikas' message gains traction, and a major industrialist agrees to announce a new factory at your next rally. However, days before the event, farmers erupt in protest over the land acquisition, blocking highways. The opposition calls it 'anti-farmer' development. How do you respond?",
      "options": [
        {
          "text": "Stand firm. Publicly back the industrial project as essential for Bihar's youth and deploy state machinery to clear the protests, branding them as politically motivated by the RJD.",
          "nextNode": "q3_jdu_demands"
        },
        {
          "text": "Play negotiator. Announce a temporary halt and form a high-level committee including farmer leaders to review the compensation package, aiming to project a pro-farmer, pro-development image.",
          "nextNode": "q3_investor_threat"
        }
      ]
    },
    "q2_reservation_gaffe": {
      "text": "Your 'Jungle Raj' rhetoric is resonating with your base. Suddenly, a senior RJD leader makes a controversial statement that is perceived as disrespectful to a prominent EBC community. This is a golden opportunity. What is your move?",
      "options": [
        {
          "text": "Go on an all-out attack. You personally lead the charge in rallies and interviews, condemning the statement and positioning the BJP as the sole protector of EBC honor and interests.",
          "nextNode": "q3_upper_caste_unease"
        },
        {
          "text": "Use a pincer movement. Have your party's EBC leaders and allies like JD(U) lead the criticism, while you maintain a statesmanlike focus on law and order and development, thus appealing to multiple audiences.",
          "nextNode": "q3_rival_apology"
        }
      ]
    },
    "q2_ally_rebellion": {
      "text": "Empowering allies has created friction. Upendra Kushwaha of RLM is publicly upset, claiming the larger partners, BJP and JD(U), are undermining his candidates in the six seats allotted to him. He threatens to hold a separate rally. How do you manage this internal crisis?",
      "options": [
        {
          "text": "Assert dominance. Summon Kushwaha for a private meeting, offer him a post-poll assurance, but demand he publicly retract his statements and cancel his rally to show NDA unity.",
          "nextNode": "q3_kushwaha_obeys"
        },
        {
          "text": "Public appeasement. You travel to one of his constituencies and hold a joint press conference with Kushwaha, praising his leadership and announcing additional campaign resources for RLM seats to project a united front.",
          "nextNode": "q3_jitan_ram_manjhi_demands"
        }
      ]
    },
    "q3_jdu_demands": {
      "text": "Your firm stance on the protest impressed industrialists but alienated farmers. Now, your crucial ally JD(U) is panicking about losing rural votes. Nitish Kumar privately demands you announce a state-wide farm loan waiver, a populist move that will strain the state's finances. What do you do?",
      "options": [
        {
          "text": "Agree to the demand. A deal is a deal. Announce the loan waiver at a joint press conference with Nitish Kumar to project alliance unity, even if it means reallocating funds from your own campaign priorities.",
          "nextNode": "q4_debate_on_economy"
        },
        {
          "text": "Reject the demand. Argue that such populism is bad for Bihar's long-term economic health and offer a counter-proposal of increased MSP and better irrigation, calling JD(U)'s bluff on their commitment to fiscal responsibility.",
          "nextNode": "q4_debate_on_farmers"
        }
      ]
    },
    "q3_investor_threat": {
      "text": "Your negotiation tactic has calmed the farmers for now, but the industrialist is furious about the delay. He threatens to scrap the project and move it to another state, a potential PR disaster. How do you secure the investment without reigniting protests?",
      "options": [
        {
          "text": "Offer a secret deal. Promise the industrialist lucrative tax breaks and faster clearances for future projects to compensate for the delay, keeping the deal out of the public eye.",
          "nextNode": "q4_rally_vikas_purush"
        },
        {
          "text": "Call a tripartite meeting. Bring the industrialist and key farmer leaders to the table for a mediated solution, positioning yourself as a problem-solver who can balance industry and agriculture.",
          "nextNode": "q4_rally_samadhan_leader"
        }
      ]
    },
    "q3_upper_caste_unease": {
      "text": "Your aggressive EBC outreach has consolidated that vote but made some of your core upper-caste supporters anxious. A powerful Bhumihar organization, traditionally loyal to the BJP, requests a private meeting to seek assurances about their 'representation and interests' in your government.",
      "options": [
        {
          "text": "Meet them and give firm assurances. Promise key cabinet positions and that their interests will be protected, ensuring your traditional base remains intact.",
          "nextNode": "q4_interview_balancing_act"
        },
        {
          "text": "Send a senior party leader to meet them but you personally avoid it. You focus your public appearances on EBC-dominant areas to signal that your priority lies with expanding the party's social base.",
          "nextNode": "q4_interview_new_bjp"
        }
      ]
    },
    "q3_rival_apology": {
      "text": "The pincer strategy works. Under pressure, Tejashwi Yadav issues a formal apology for his leader's statement. The media is now debating if the issue is over. Your campaign team is divided on the next step.",
      "options": [
        {
          "text": "Accept the apology and pivot. Declare a 'victory for social decorum' and immediately shift your campaign focus back to development and corruption, portraying yourself as a mature leader.",
          "nextNode": "q4_rally_governance_focus"
        },
        {
          "text": "Reject the apology as 'crocodile tears'. Continue to press the issue, arguing it reveals the RJD's true anti-EBC mindset, and milk the controversy for all its worth.",
          "nextNode": "q4_rally_caste_crusader"
        }
      ]
    },
    "q3_kushwaha_obeys": {
      "text": "Your strong-arm tactic works. Kushwaha falls in line, cancels his rally, and appears at your press conference, albeit looking grim. Party cohesion is maintained through force, but you sense resentment among his cadre. Now you must allocate the final tranche of campaign funds.",
      "options": [
        {
          "text": "Divert funds to BJP strongholds. Since the allies are in line, use the money to maximize your own party's seat count, especially in urban areas.",
          "nextNode": "q4_modi_mega_rally"
        },
        {
          "text": "Allocate a significant portion to the constituencies of LJP(R)'s Chirag Paswan. This rewards a loyal ally and helps secure the crucial Dalit vote, further isolating Kushwaha.",
          "nextNode": "q4_paswan_youth_rally"
        }
      ]
    },
    "q3_jitan_ram_manjhi_demands": {
      "text": "Your public appeasement of Kushwaha has emboldened other allies. Jitan Ram Manjhi of HAM(S) now demands a joint rally with you in his stronghold of Gaya and insists his son be projected as the future Deputy CM for the Mahadalit community.",
      "options": [
        {
          "text": "Reject the Dy CM demand but agree to the rally. State that leadership roles will be decided post-election, but share the stage with Manjhi to secure his community's votes.",
          "nextNode": "q4_gaya_rally_focus"
        },
        {
          "text": "Decline both requests. Send a clear message that appeasement has its limits and that the campaign will be led by the BJP's agenda, not the demands of minor partners.",
          "nextNode": "q4_patna_press_conference"
        }
      ]
    },
    "q4_debate_on_economy": {
      "text": "You are in the final televised debate. Tejashwi Yadav attacks you on the farm loan waiver, calling it a 'desperate electoral bribe' that will bankrupt Bihar. This is your moment to defend your economic vision.",
      "options": [
        {
          "text": "Own it. Frame the waiver as a moral duty to help farmers hit by agricultural distress, and contrast it with the alleged corruption of the RJD era, asking 'Where did the money go then?'.",
          "nextNode": "q5_waiver_social_media"
        },
        {
          "text": "Deflect and attack. Pivot from the waiver to your industrial policy, promising 'jobs, not doles'. Accuse Tejashwi of having no vision for youth employment beyond empty promises.",
          "nextNode": "q5_youth_job_blitz"
        }
      ]
    },
    "q4_debate_on_farmers": {
      "text": "In the final TV debate, Tejashwi Yadav corners you on the farmer protest incident, showing pictures of injured farmers. He calls you 'anti-farmer' and a 'friend of big capitalists'. How do you counter this emotional attack?",
      "options": [
        {
          "text": "Apologize for the use of force but defend the development project as vital for Bihar's future. Announce your enhanced crop insurance scheme as a concrete long-term solution.",
          "nextNode": "q5_grassroots_outreach"
        },
        {
          "text": "Double down. Accuse the RJD of orchestrating the violence and state that you will not let Bihar's development be stalled by 'goons and middlemen'.",
          "nextNode": "q5_fear_and_order_campaign"
        }
      ]
    },
    "q4_rally_vikas_purush": {
      "text": "The industrialist is pacified and agrees to appear at your grand 'Vikas Rally' in Patna. This is your chance to project yourself as the ultimate development icon. What is the key message of your speech?",
      "options": [
        {
          "text": "Focus on the future. Announce a 'Made in Bihar' policy with a 10-year roadmap for industrialization, positioning yourself as a visionary leader.",
          "nextNode": "q5_op_ed_newspapers"
        },
        {
          "text": "Contrast with the past. Spend half the speech detailing the economic stagnation during the RJD's 'Jungle Raj' and the other half showcasing your new investment as the dawn of a new era.",
          "nextNode": "q5_jungle_raj_reminders"
        }
      ]
    },
    "q4_rally_samadhan_leader": {
      "text": "The tripartite meeting was a success, and both the industrialist and farmer leaders have agreed to appear at your 'Samadhan Rally'. You are being hailed as a pragmatic problem-solver. How do you leverage this image in your headline speech?",
      "options": [
        {
          "text": "Position it as the 'Bihar Model'. Argue that your approach of dialogue and consensus is the only way forward, contrasting it with the opposition's politics of 'confrontation and chaos'.",
          "nextNode": "q5_all_party_appeal"
        },
        {
          "text": "Make a personal appeal. Share an emotional story about your commitment to both the farmer's soil and the youth's future, asking for a strong mandate to continue this path of reconciliation.",
          "nextNode": "q5_door_to_door_karyakartas"
        }
      ]
    },
    "q4_interview_balancing_act": {
      "text": "You're on a primetime interview with a national channel. The journalist presses you: 'Your opponents say you are playing both sides, appeasing upper castes in private while championing EBCs in public. Who does the BJP truly stand for?'",
      "options": [
        {
          "text": "Evade and broaden. Talk about 'Sabka Saath, Sabka Vikas' and state that your party is for all Biharis. Criticize the opposition for trying to divide society with caste politics.",
          "nextNode": "q5_pm_modi_hologram"
        },
        {
          "text": "Confront and define. State that the BJP stands for the poor, regardless of caste. Argue that your EBC outreach is about uplifting the most deprived, a goal that benefits the entire state.",
          "nextNode": "q5_welfare_scheme_push"
        }
      ]
    },
    "q4_interview_new_bjp": {
      "text": "Your focus on EBCs has made headlines. In a major interview, the anchor asks, 'By sidelining your traditional upper-caste base, are you admitting that the BJP's old model has failed in Bihar?'",
      "options": [
        {
          "text": "Frame it as expansion. 'We are not sidelining anyone; we are expanding our family. The BJP is the only party where a person from an EBC background can become Prime Minister.'",
          "nextNode": "q5_ebc_leaders_tour"
        },
        {
          "text": "Frame it as pragmatism. 'Politics is about winning trust. We are responding to the aspirations of the largest section of Bihar's population who have been let down by caste-based parties.'",
          "nextNode": "q5_caste_census_promise"
        }
      ]
    },
    "q4_rally_governance_focus": {
      "text": "At a major rally in Muzaffarpur, you have the stage. Having successfully pivoted from the caste controversy, this is your chance to set the agenda for the final week. What is your primary focus?",
      "options": [
        {
          "text": "Announce a new, detailed anti-corruption helpline and promise a time-bound investigation into scams from the previous Mahagathbandhan government.",
          "nextNode": "q5_corruption_dossier"
        },
        {
          "text": "Unveil a '7-Point Governance Charter' for your first 100 days in office, focusing on bureaucratic reforms, infrastructure completion, and ease of doing business.",
          "nextNode": "q5_good_governance_pledge"
        }
      ]
    },
    "q4_rally_caste_crusader": {
      "text": "You've decided to keep the pressure on. At a massive rally in an EBC-dominated area, you hold up a copy of the rival leader's statement. How do you frame your attack?",
      "options": [
        {
          "text": "As an insult to the entire community. 'This is not just a slip of the tongue; this is the feudal mindset of the RJD that has kept you oppressed for generations.'",
          "nextNode": "q5_polarizing_statement"
        },
        {
          "text": "As a threat to reservations. 'Today they insult you, tomorrow they will snatch your rights. This election is a fight to protect the reservation system from the RJD's conspiracies.'",
          "nextNode": "q5_reservation_guarantee"
        }
      ]
    },
    "q4_modi_mega_rally": {
      "text": "The stage is set for a mega rally in Patna with the Prime Minister. This is the climax of your campaign. What do you ask PM Modi to emphasize in his speech to create a final, decisive wave?",
      "options": [
        {
          "text": "Ask him to announce a special economic package for Bihar, focusing on AI, technology, and creating 10 lakh high-tech jobs.",
          "nextNode": "q5_package_saturation"
        },
        {
          "text": "Ask him to focus on national security and the 'double engine government' narrative, contrasting a strong Center-State partnership with the instability and corruption of the 'Mahagathbandhan'.",
          "nextNode": "q5_nationalist_surge"
        }
      ]
    },
    "q4_paswan_youth_rally": {
      "text": "You decide to hold a large rally targeting youth and Dalits with Chirag Paswan as the co-headliner. Chirag is known for his fiery speeches. What is the tone of the event?",
      "options": [
        {
          "text": "Aspirational: Focus on 'Bihar First, Bihari First', promising jobs, dignity, and an end to migration. You and Chirag position yourselves as the faces of a new, modern Bihar.",
          "nextNode": "q5_youth_icon_social_media"
        },
        {
          "text": "Aggressive: Use the stage to launch a blistering attack on the RJD for its historical injustices against Dalits and on Nitish Kumar for failing to deliver on his promises.",
          "nextNode": "q5_dalit_outreach_blitz"
        }
      ]
    },
    "q4_gaya_rally_focus": {
      "text": "You are sharing the stage with Jitan Ram Manjhi in Gaya. It's a crucial event to consolidate the Mahadalit vote. Manjhi gives a powerful, emotional speech. When it's your turn, what is your key message?",
      "options": [
        {
          "text": "Praise Manjhi as a 'father figure' and promise to fulfill his vision for the community. Announce a new scholarship scheme named after a Mahadalit icon.",
          "nextNode": "q5_manjhi_endorsement"
        },
        {
          "text": "Link Mahadalit welfare directly to PM Modi's central schemes (like free ration, housing). Argue that only a 'double engine' government can ensure these benefits continue to reach them.",
          "nextNode": "q5_central_schemes_push"
        }
      ]
    },
    "q4_patna_press_conference": {
      "text": "Having snubbed your allies, you call a major press conference in Patna to project strength and reclaim the narrative. The room is packed with national and local media. What is your headline announcement?",
      "options": [
        {
          "text": "Unveil a 'BJP's Sankalp Patra' (Pledge Document) for Bihar, a comprehensive manifesto that goes beyond coalition promises and details your party's specific vision.",
          "nextNode": "q5_manifesto_drive"
        },
        {
          "text": "Declare that if elected, you will establish a Chief Minister's task force to investigate all corruption allegations against the previous RJD and Mahagathbandhan governments.",
          "nextNode": "q5_corruption_hotline"
        }
      ]
    },
    "q5_waiver_social_media": {
      "text": "Your debate performance was seen as a strong defense of farmers. For the final 48 hours, how do you amplify this message?",
      "options": [
        {
          "text": "Launch a social media blitz with infographics and short videos titled 'BJP: Kisan-Hitai, RJD: Bhrashtachar-Bhai' (BJP: Pro-Farmer, RJD: Pro-Corruption).",
          "nextNode": "end_populist_victory"
        },
        {
          "text": "Organize a massive 'Kisan Dhanyawad Sammelan' (Farmer Thanksgiving Meet) in a rural heartland, framing the election as a choice between those who deliver and those who deceive.",
          "nextNode": "end_rural_wave"
        }
      ]
    },
    "q5_youth_job_blitz": {
      "text": "Your focus on jobs in the debate resonated with the youth. You have 48 hours to seal the deal with this crucial demographic. What is your final move?",
      "options": [
        {
          "text": "Launch a dedicated portal for youth to pre-register for the promised jobs, creating a tangible sense of hope and capturing valuable voter data.",
          "nextNode": "end_youth_mandate"
        },
        {
          "text": "Send out a personalized letter from yourself via WhatsApp to every young voter in the database, promising a 'new deal' for Bihar's future.",
          "nextNode": "end_tech_savvy_win"
        }
      ]
    },
    "q5_grassroots_outreach": {
      "text": "Your conciliatory tone in the debate has softened your image. To capitalize on this in the final 48 hours, what is the best grassroots strategy?",
      "options": [
        {
          "text": "Deploy party workers to go door-to-door in rural areas, specifically to apologize for any 'misunderstanding' over the protests and explain the benefits of the insurance scheme.",
          "nextNode": "end_narrow_escape"
        },
        {
          "text": "Organize 'Chai pe Charcha' (Discussion over Tea) events in every block, led by local leaders, to listen to farmer grievances and reinforce your commitment to their welfare.",
          "nextNode": "end_atonement_loss"
        }
      ]
    },
    "q5_fear_and_order_campaign": {
      "text": "Your aggressive debate performance has energized your core supporters who value a strong leader. How do you use the final 48 hours to maximize this momentum?",
      "options": [
        {
          "text": "Run front-page newspaper ads with the headline: 'Vikas ya Vinaash?' (Development or Destruction?), featuring images of development on one side and chaos on the other.",
          "nextNode": "end_strongman_win"
        },
        {
          "text": "Conduct a motorcycle rally of thousands of party youth workers across major cities, creating a show of force and projecting an image of inevitable victory.",
          "nextNode": "end_fear_backfires"
        }
      ]
    },
    "q5_op_ed_newspapers": {
      "text": "The 'Vikas Purush' rally was a huge success. To cement this intellectual, forward-looking image in the final 48 hours, what is your move?",
      "options": [
        {
          "text": "Publish an op-ed under your name in all major Bihari newspapers detailing your 10-year economic plan, appealing to the educated, urban middle class.",
          "nextNode": "end_urban_sweep_win"
        },
        {
          "text": "Hold a town hall with young entrepreneurs and tech professionals, livestreamed on all social media platforms, to discuss the 'Startup Bihar' vision.",
          "nextNode": "end_niche_victory"
        }
      ]
    },
    "q5_jungle_raj_reminders": {
      "text": "The rally successfully contrasted your vision with the RJD's past. For the final 48 hours, your team suggests a final, hard-hitting push.",
      "options": [
        {
          "text": "Launch a 'Gunda Raj ke 15 Saal' (15 years of Criminal Rule) social media campaign with testimonials from victims of crimes during the RJD era.",
          "nextNode": "end_fear_is_the_key"
        },
        {
          "text": "Have the PM record a short video message for Bihar, warning voters not to let the 'lantern of lawlessness' be lit again.",
          "nextNode": "end_pm_seals_deal"
        }
      ]
    },
    "q5_all_party_appeal": {
      "text": "Your image as a consensus-builder is at its peak. How do you make your final appeal in the last 48 hours?",
      "options": [
        {
          "text": "Issue a public appeal to voters of all parties, including the opposition, to rise above party lines and vote for the 'Bihar Model' of progress.",
          "nextNode": "end_consensus_victory"
        },
        {
          "text": "Organize a silent march for 'Peace and Progress' in Patna, led by you and prominent civil society members, to stand in contrast to noisy political rallies.",
          "nextNode": "end_idealistic_loss"
        }
      ]
    },
    "q5_door_to_door_karyakartas": {
      "text": "Your personal appeal at the rally was well-received. For the final 48 hours, how do you translate this personal connection into votes?",
      "options": [
        {
          "text": "Dispatch thousands of RSS and BJP karyakartas for an intensive door-to-door campaign, carrying your personal letter and asking for votes in your name.",
          "nextNode": "end_personal_touch_win"
        },
        {
          "text": "Spend the last two days visiting small towns and villages yourself, holding informal 'nukkad sabhas' (street corner meetings) to reinforce your personal commitment.",
          "nextNode": "end_exhausting_effort"
        }
      ]
    },
    "q5_pm_modi_hologram": {
      "text": "Your 'Sabka Saath' interview answer was seen as politically safe. For the final 48 hours, you need a high-impact event to create a wave.",
      "options": [
        {
          "text": "Organize a state-of-the-art hologram rally of PM Modi, allowing his message of development and unity to reach 50 locations across Bihar simultaneously.",
          "nextNode": "end_high_tech_gamble"
        },
        {
          "text": "Focus on women voters. Announce a major new scheme for women's self-help groups and deploy women party workers for a targeted door-to-door campaign.",
          "nextNode": "end_silent_voter_swings"
        }
      ]
    },
    "q5_welfare_scheme_push": {
      "text": "Your pro-poor stance in the interview was powerful. In the final 48 hours, how do you ensure this message reaches every last voter?",
      "options": [
        {
          "text": "Flood every constituency with pamphlets and posters highlighting PM Modi's welfare schemes (free ration, housing, gas cylinders) and promise to expand them in Bihar.",
          "nextNode": "end_welfare_wave_wins"
        },
        {
          "text": "Use the party machinery to identify and personally contact beneficiaries of central schemes in every booth, urging them to vote for the 'double-engine' government to ensure continued benefits.",
          "nextNode": "end_beneficiary_politics_victory"
        }
      ]
    },
    "q5_ebc_leaders_tour": {
      "text": "Your 'expanding the family' message has been a hit. For the final 48 hours, you need to showcase this 'New BJP'.",
      "options": [
        {
          "text": "Organize a whirlwind tour of all prominent EBC leaders of the BJP and its allies across the state, holding dozens of small rallies to show a united front.",
          "nextNode": "end_social_engineering_success"
        },
        {
          "text": "You personally visit a series of temples and ashrams associated with EBC spiritual leaders, seeking their blessings publicly to send a powerful symbolic message.",
          "nextNode": "end_risky_symbolism"
        }
      ]
    },
    "q5_caste_census_promise": {
      "text": "Your pragmatic appeal to EBC aspirations was a bold move. To counter the RJD's dominance on this issue, what radical step do you take in the final 48 hours?",
      "options": [
        {
          "text": "Promise to implement the findings of the Bihar Caste Survey within 6 months of forming the government, effectively stealing the RJD's main plank.",
          "nextNode": "end_masterstroke_victory"
        },
        {
          "text": "Announce the formation of a new 'Extremely Backward Classes Development Ministry' with a dedicated budget, promising concrete action over mere census politics.",
          "nextNode": "end_promise_fatigue_loss"
        }
      ]
    },
    "q5_corruption_dossier": {
      "text": "Your anti-corruption promise at the rally has the opposition rattled. How do you deliver the final blow in the last 48 hours?",
      "options": [
        {
          "text": "Release a 'dossier' of alleged corruption under the previous Mahagathbandhan government at a press conference, with documents and details.",
          "nextNode": "end_knockout_punch"
        },
        {
          "text": "Run a TV ad campaign featuring an animated caricature of a corrupt politician, which strongly resembles opposition leaders, siphoning money from the state treasury.",
          "nextNode": "end_mudslinging_backfires"
        }
      ]
    },
    "q5_good_governance_pledge": {
      "text": "The 'Governance Charter' was well-received by the media and urban voters. How do you make this your final, winning message?",
      "options": [
        {
          "text": "Have all your candidates publicly sign a 'Good Governance Pledge' at simultaneous events across the state, promising transparency and accountability.",
          "nextNode": "end_good_governance_win"
        },
        {
          "text": "Launch a 'Call Your Candidate' campaign, publishing the phone numbers of all your candidates and encouraging voters to call them with their issues before the election.",
          "nextNode": "end_gimmick_fails"
        }
      ]
    },
    "q5_polarizing_statement": {
      "text": "Your rally speech has sharply polarized the electorate on caste lines. You have a choice: double down or try to moderate in the final 48 hours.",
      "options": [
        {
          "text": "Double down. Issue a final statement saying 'An attack on one EBC is an attack on all EBCs. Vote for your honor.' This will maximize your EBC turnout but alienate everyone else.",
          "nextNode": "end_caste_consolidation_win"
        },
        {
          "text": "Moderate. Give an interview where you state your comments were about the RJD's mindset, not any other community, and appeal for social harmony.",
          "nextNode": "end_mixed_messages_loss"
        }
      ]
    },
    "q5_reservation_guarantee": {
      "text": "Your message linking the RJD's statement to a threat against reservations is causing panic and consolidation. What is your final move in the last 48 hours?",
      "options": [
        {
          "text": "Hold a press conference with all NDA allies and take a collective oath to 'protect reservations at all costs', framing the NDA as the sole guarantor.",
          "nextNode": "end_protector_of_rights_win"
        },
        {
          "text": "Publish advertisements featuring an image of Babasaheb Ambedkar, with a quote from you saying 'We will sacrifice everything, but we will not let the RJD touch the constitution.'",
          "nextNode": "end_symbolic_victory"
        }
      ]
    },
    "q5_package_saturation": {
      "text": "The PM's announcement of a massive economic package is the biggest news. For the final 48 hours, how do you ensure this message reaches every voter?",
      "options": [
        {
          "text": "Saturation advertising: Use every available ad slot on TV, radio, and digital platforms to play a loop of the PM's announcement and your promise to implement it.",
          "nextNode": "end_package_delivers_win"
        },
        {
          "text": "Ground mobilization: Task party workers to visit every home in their booth area with a pamphlet detailing the benefits of the package for their specific district.",
          "nextNode": "end_last_mile_victory"
        }
      ]
    },
    "q5_nationalist_surge": {
      "text": "The PM's rally has created a strong nationalist and pro-NDA wave. In the final 48 hours, how do you convert this wave into maximum seats?",
      "options": [
        {
          "text": "Frame the election as a vote for PM Modi. Your final message is: 'Every vote for BJP in Bihar is a vote for a stronger India under Modi-ji.'",
          "nextNode": "end_modi_wave_victory"
        },
        {
          "text": "Focus on the 'Double Engine' failures in opposition-ruled states. Run a comparative ad campaign showing chaos and lack of central support in other states vs. the progress in NDA states.",
          "nextNode": "end_double_engine_win"
        }
      ]
    },
    "q5_youth_icon_social_media": {
      "text": "The rally with Chirag Paswan projected a young, dynamic image for the NDA. How do you leverage this on social media in the final 48 hours?",
      "options": [
        {
          "text": "Launch a 'Bihar Ka Future' (Bihar's Future) campaign featuring slickly edited videos of you and Chirag, and host a live Instagram Q&A session with young voters.",
          "nextNode": "end_youth_quake_victory"
        },
        {
          "text": "Create and boost viral memes and short videos that mock the 'old-fashioned' politics of the RJD and portray Tejashwi Yadav as out of touch with youth aspirations.",
          "nextNode": "end_viral_victory"
        }
      ]
    },
    "q5_dalit_outreach_blitz": {
      "text": "The aggressive rally with Chirag has fired up the Dalit base but worried some moderate allies. What is your tactical move for the final 48 hours?",
      "options": [
        {
          "text": "Conduct a whirlwind tour with Chirag Paswan through the Dalit-majority constituencies, making a powerful push to consolidate this vote bank completely.",
          "nextNode": "end_dalit_consolidation_win"
        },
        {
          "text": "You personally hold a press conference with Nitish Kumar to project a more moderate, unified image, while Chirag continues his aggressive campaign separately.",
          "nextNode": "end_balancing_act_fails"
        }
      ]
    },
    "q5_manjhi_endorsement": {
      "text": "The Gaya rally was a success. Manjhi is now fully on board. How do you capitalize on his support in the crucial final 48 hours?",
      "options": [
        {
          "text": "Feature Jitan Ram Manjhi's emotional speech from the rally in paid advertisements across the state, with your voiceover saying 'We will fulfill Manjhi-ji's dream'.",
          "nextNode": "end_mahadalit_swing_win"
        },
        {
          "text": "Deploy HAM(S) and BJP workers jointly for a door-to-door campaign in Mahadalit bastis, distributing sweets and promising a new era of dignity.",
          "nextNode": "end_grassroots_synergy_win"
        }
      ]
    },
    "q5_central_schemes_push": {
      "text": "The message of linking welfare to the 'double engine' government was clear. How do you hammer this home in the final 48 hours?",
      "options": [
        {
          "text": "Send a bulk voice message from you to millions of voters, saying 'To keep getting free ration and pucca houses from Modi-ji, vote for the BJP's lotus symbol.'",
          "nextNode": "end_welfare_contract_win"
        },
        {
          "text": "Set up 'Labharthi Sampark' (Beneficiary Contact) desks outside polling booths to 'assist' voters and remind them of the benefits they have received from the central government.",
          "nextNode": "end_controversial_tactic_win"
        }
      ]
    },
    "q5_manifesto_drive": {
      "text": "The BJP-specific manifesto has positioned you as the clear leader of the NDA. How do you ensure this message cuts through the noise in the final 48 hours?",
      "options": [
        {
          "text": "Take out full-page jacket ads in all major newspapers showcasing the cover of your 'Sankalp Patra' and your photo, with minimal space for allies.",
          "nextNode": "end_solitary_strength_win"
        },
        {
          "text": "Mobilize the entire party cadre to distribute copies of the manifesto door-to-door, emphasizing that these are the BJP's direct promises to the people of Bihar.",
          "nextNode": "end_organizational_victory"
        }
      ]
    },
    "q5_corruption_hotline": {
      "text": "Your anti-corruption stance is your trump card. For the final 48 hours, how do you make this the single most important issue for the voter?",
      "options": [
        {
          "text": "Launch a 'Corruption Hotline' number on which people can leave voice messages reporting their experiences with corruption, promising to make the recordings public after the election.",
          "nextNode": "end_crusader_victory"
        },
        {
          "text": "Release a final campaign video that intercuts images of opposition leaders with visuals of handcuffs and jail cells, promising a 'clean-up' of Bihar politics.",
          "nextNode": "end_aggressive_win_but_polarized"
        }
      ]
    },
    "end_populist_victory": {
      "isEnding": true,
      "text": "Victory! Your pro-farmer rhetoric and social media blitz deliver a comfortable majority.",
      "summary": "Your path, starting with a 'Vikas First' message, hit a crisis with the farmer protest. By choosing force and then placating JD(U) with a loan waiver, you took a high-risk populist turn. Defending this waiver as a moral duty in the final debate and amplifying it through a savvy social media campaign proved to be a winning formula. You successfully painted the RJD as corrupt and yourself as a champion of farmers. You have a strong mandate, but the expensive waiver promise will be the first major challenge for your new government, casting a shadow on the state's economic outlook.",
      "stats": {
        "publicApproval": "58%",
        "economicOutlook": "Populist Strain",
        "partyCohesion": "Stable",
        "socialFabric": "Moderately Strained"
      }
    },
    "end_rural_wave": {
      "isEnding": true,
      "text": "A rural wave in your favor! The 'Kisan Dhanyawad Sammelan' seals a decisive victory for the NDA.",
      "summary": "You began with a development-first agenda but faced a major farmer protest. Your decision to use force was risky, but you corrected course by agreeing to JD(U)'s demand for a loan waiver. This pivot, combined with your strong defense of farmers in the debate and the masterstroke of a final 'Thanksgiving Meet', turned a potential disaster into a rural wave of support. The electorate saw you as a strong leader who also listens. You have a clear majority and strong party cohesion, but you now have to manage the fiscal implications of your populist promise.",
      "stats": {
        "publicApproval": "62%",
        "economicOutlook": "Populist Strain",
        "partyCohesion": "Iron Grip",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_youth_mandate": {
      "isEnding": true,
      "text": "You've won! The youth vote, galvanized by your job portal, has carried you to a spectacular victory.",
      "summary": "Your campaign began with a laser focus on 'Vikas'. After facing farmer protests, you used force but then agreed to a loan waiver to keep the alliance intact. In the final debate, your pivot back to youth employment and the innovative launch of a job pre-registration portal in the last 48 hours created a massive surge of support among young voters. They saw a tangible promise over rhetoric. This has given you a powerful mandate for economic reform. However, your forceful handling of the initial protest has left a lingering resentment in some rural quarters.",
      "stats": {
        "publicApproval": "65%",
        "economicOutlook": "Strong Mandate for Growth",
        "partyCohesion": "Stable",
        "socialFabric": "Moderately Strained"
      }
    },
    "end_tech_savvy_win": {
      "isEnding": true,
      "text": "A narrow victory! Your last-minute digital outreach to young voters made the difference in key seats.",
      "summary": "You started with a 'Vikas' message, handled a farmer protest with force, and then conceded to a populist loan waiver to save your alliance with JD(U). While your debate performance successfully shifted the focus back to jobs, it was the final, personalized WhatsApp campaign that tipped the scales in several tight urban and semi-urban contests. You scraped through with a slim majority, proving the power of modern campaign techniques. However, the victory is fragile. The expensive waiver will challenge your economic plans, and party cohesion is weakened by the concessions made to allies.",
      "stats": {
        "publicApproval": "51%",
        "economicOutlook": "Populist Strain",
        "partyCohesion": "Internal Dissent",
        "socialFabric": "Moderately Strained"
      }
    },
    "end_narrow_escape": {
      "isEnding": true,
      "text": "You've just scraped by! The last-minute apology tour in rural areas was enough to secure a razor-thin majority.",
      "summary": "Your 'Vikas' campaign was nearly derailed by the farmer protest. Rejecting JD(U)'s populist demands while also appearing anti-farmer put you in a precarious position. Your apologetic tone in the debate and the subsequent door-to-door outreach was a high-risk gamble that paid off—just barely. You managed to convince enough rural voters that you were sincere, securing a wafer-thin victory. Your refusal to grant the loan waiver maintains fiscal discipline but has severely strained your relationship with JD(U), promising a turbulent term ahead. Your party's internal cohesion is at a low point.",
      "stats": {
        "publicApproval": "50.5%",
        "economicOutlook": "Stable but Tense",
        "partyCohesion": "Internal Dissent",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_atonement_loss": {
      "isEnding": true,
      "text": "Defeat. Your attempts to win back farmers in the final days were seen as 'too little, too late'.",
      "summary": "The campaign started on a high note of development but got stuck in the mud of the farmer protest. Your decision to reject the loan waiver while simultaneously trying to appear pro-farmer through conciliatory debate tactics and 'Chai pe Charcha' events sent mixed signals. Voters perceived it as weakness and insincerity. The opposition successfully branded you as anti-farmer, leading to a significant loss in rural constituencies that your urban gains could not offset. Your party is now in opposition, facing internal blame for the strategic missteps.",
      "stats": {
        "publicApproval": "44%",
        "economicOutlook": "Uncertain Mandate",
        "partyCohesion": "Blame Game",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_strongman_win": {
      "isEnding": true,
      "text": "A stunning victory! Your strong, uncompromising stance on development and order has won you a powerful mandate.",
      "summary": "Your campaign was defined by strength. From the 'Vikas First' slogan to forcefully handling protests and rejecting populist demands from allies, you projected an image of a no-nonsense leader. This culminated in your aggressive debate performance and a final, hard-hitting ad campaign. The strategy worked, consolidating the urban, middle-class, and law-and-order vote into a decisive majority. You have an iron grip on the party and a strong mandate for growth. However, this has come at the cost of alienating a significant portion of the rural populace and deeply polarizing society.",
      "stats": {
        "publicApproval": "60%",
        "economicOutlook": "Strong Mandate for Growth",
        "partyCohesion": "Iron Grip",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_fear_backfires": {
      "isEnding": true,
      "text": "A narrow defeat. Your final show of force was perceived as arrogance and alienated moderate voters.",
      "summary": "Your strongman strategy, from suppressing protests to an aggressive debate style, initially energized your base. However, the final 48-hour motorcycle rally was a tactical error. The opposition successfully framed it as 'gunda-gardi' (hooliganism), reminding moderate voters of the very chaos you accused the RJD of. This last-minute shift in perception cost you crucial swing seats, leading to a narrow loss. While your grip on the party remains, your campaign has left the social fabric of Bihar more divided than ever.",
      "stats": {
        "publicApproval": "47%",
        "economicOutlook": "Uncertain Mandate",
        "partyCohesion": "Stable",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_urban_sweep_win": {
      "isEnding": true,
      "text": "A comfortable victory, powered by a massive sweep of urban and semi-urban seats!",
      "summary": "Your campaign began with 'Vikas First'. You masterfully navigated the farmer protest by negotiating a solution and kept investors happy with private assurances. Your 'Vikas Purush' rally and the final intellectual appeal through a newspaper op-ed consolidated the educated, middle-class, and youth vote in a way not seen before. This created a huge wave in urban centers that was enough to deliver a comfortable majority for the NDA. You have a strong mandate for your economic vision, though you will need to work to bridge the growing urban-rural divide.",
      "stats": {
        "publicApproval": "59%",
        "economicOutlook": "Strong Mandate for Growth",
        "partyCohesion": "Iron Grip",
        "socialFabric": "Urban-Rural Divide"
      }
    },
    "end_niche_victory": {
      "isEnding": true,
      "text": "A close call! You've won, but your victory is confined to a few major cities.",
      "summary": "Your strategy of negotiation with farmers and appeasement of industrialists was clever but complex. The campaign, culminating in a tech-focused town hall, resonated strongly with a niche audience of entrepreneurs and urban youth but failed to create a broader wave. You've won just enough seats in cities like Patna, Muzaffarpur, and Bhagalpur to form a government with a razor-thin majority. Your authority is weak, and the party's rural base feels ignored, leading to low cohesion. Governing will be a challenge as your mandate is not statewide.",
      "stats": {
        "publicApproval": "51%",
        "economicOutlook": "Limited for Urban Growth",
        "partyCohesion": "Internal Dissent",
        "socialFabric": "Urban-Rural Divide"
      }
    },
    "end_fear_is_the_key": {
      "isEnding": true,
      "text": "Victory. The final reminder of the 'Jungle Raj' was enough to push you over the finish line.",
      "summary": "Your campaign masterfully blended a forward-looking 'Vikas' message with a potent fear of the past. After negotiating a truce between farmers and industry, you used the final rally to pivot hard against the RJD's history. The last-minute social media campaign featuring testimonials from victims of the RJD era was brutal but effective. It mobilized your base and swung undecided voters who prioritized security over other issues. You have won a clear, if polarized, victory. Your party is united, but the campaign has deepened social distrust.",
      "stats": {
        "publicApproval": "56%",
        "economicOutlook": "Stable Mandate",
        "partyCohesion": "Strong",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_pm_seals_deal": {
      "isEnding": true,
      "text": "A landslide! The Prime Minister's final video message created a massive wave, leading to a huge victory.",
      "summary": "Your campaign was a model of crisis management and effective messaging. You turned a farmer protest into a 'Samadhan Rally' and pacified investors. But the real masterstroke was bringing in the Prime Minister for the final push. His rally contrasting your vision with the RJD's past, followed by his direct video appeal, nationalized the election's final phase. Voters chose the assurance of the PM's leadership, delivering a landslide victory for the NDA. You have an unprecedented mandate and full party support, though the state's social fabric remains tense.",
      "stats": {
        "publicApproval": "68%",
        "economicOutlook": "Strong Mandate for Growth",
        "partyCohesion": "Iron Grip",
        "socialFabric": "Moderately Polarized"
      }
    },
    "end_consensus_victory": {
      "isEnding": true,
      "text": "A historic victory! Your message of consensus and reconciliation has won hearts across party lines.",
      "summary": "Your campaign was a masterclass in pragmatic leadership. Starting with 'Vikas', you handled the farmer protest by bringing all parties to the table, showcasing a new style of politics. This culminated in your 'Samadhan Rally' and a final, powerful appeal for unity. This unique message of consensus-building attracted a significant number of moderate voters, even from the opposition's camp, leading to a historic, broad-based victory. You have immense public approval and a harmonious social environment, giving you a perfect platform to launch your 'Bihar Model'.",
      "stats": {
        "publicApproval": "70%",
        "economicOutlook": "Strong Mandate for Growth",
        "partyCohesion": "Strong",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_idealistic_loss": {
      "isEnding": true,
      "text": "Defeat. Your idealistic appeal was admired by commentators but failed to translate into votes.",
      "summary": "While your handling of the farmer-industry dispute was praised for its maturity, your campaign failed to generate the passion needed to win a tough election. The 'Samadhan Rally' was a media success, but the final silent march was seen as a passive, ineffective tactic in Bihar's noisy political arena. The opposition's aggressive caste-based mobilization and populist promises ultimately proved more effective. You have lost the election but won respect as a statesman, though your party is disappointed with the idealistic approach.",
      "stats": {
        "publicApproval": "46%",
        "economicOutlook": "Status Quo",
        "partyCohesion": "Internal Dissent",
        "socialFabric": "Moderately Polarized"
      }
    },
    "end_personal_touch_win": {
      "isEnding": true,
      "text": "You've won! The massive door-to-door campaign in your name proved decisive.",
      "summary": "Your journey from a 'Vikas' proponent to a pragmatic 'Samadhan' leader resonated with voters. Your personal appeal at the final rally, followed by a superbly executed door-to-door campaign by the party cadre, created a powerful personal connection with the electorate. Voters felt they were voting for you, not just the party. This grassroots effort overcame the opposition's narrative and delivered a solid victory. Your personal brand is at an all-time high, and your control over the party is absolute.",
      "stats": {
        "publicApproval": "63%",
        "economicOutlook": "Strong Personal Mandate",
        "partyCohesion": "Iron Grip",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_exhausting_effort": {
      "isEnding": true,
      "text": "A narrow, exhausting loss. Your solo last-minute efforts were heroic but not enough.",
      "summary": "Your campaign, which saw you successfully mediate a major conflict between farmers and industry, was commendable. However, your decision to personally campaign in every nook and cranny in the final 48 hours, while heroic, was strategically flawed. It spread your efforts too thin and could not match the organized, booth-level mobilization of the opposition. You lost a number of key seats by slim margins. Your personal popularity has increased, but the party machinery is being blamed for failing to convert it into a victory.",
      "stats": {
        "publicApproval": "48%",
        "economicOutlook": "Uncertain Mandate",
        "partyCohesion": "Blame Game",
        "socialFabric": "Moderately Strained"
      }
    },
    "end_high_tech_gamble": {
      "isEnding": true,
      "text": "A surprise victory! The PM's hologram rally was a novelty that captured the public's imagination and swung the election.",
      "summary": "You started with a 'Social Harmony' message and capitalized on an RJD gaffe. After securing your upper-caste base and delivering a safe interview performance, the campaign seemed to be drifting. The decision to use a hologram rally was a high-tech, high-risk gamble that paid off spectacularly. The sheer novelty and scale of the event created a last-minute buzz that the opposition couldn't counter, especially among younger, tech-savvy voters. You've won a surprising majority, though some old-guard leaders in your party are skeptical of these 'gimmicks'.",
      "stats": {
        "publicApproval": "57%",
        "economicOutlook": "Mandate for Modernization",
        "partyCohesion": "Stable",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_silent_voter_swings": {
      "isEnding": true,
      "text": "Victory! The silent female voters have given you the mandate.",
      "summary": "Your 'Social Harmony' campaign successfully navigated the complexities of caste politics. You capitalized on the RJD's mistake, reassured your base, and maintained a balanced public posture. The masterstroke was your final 48-hour push to target women voters. The new welfare scheme, amplified by a dedicated all-women ground campaign, mobilized a decisive 'silent' vote in your favor. You have won a clear and comfortable majority, proving that focusing on this key demographic can override other factors. Your party is united behind this successful strategy.",
      "stats": {
        "publicApproval": "61%",
        "economicOutlook": "Welfare-Oriented Growth",
        "partyCohesion": "Strong",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_welfare_wave_wins": {
      "isEnding": true,
      "text": "A resounding victory! The promise of continued welfare schemes created a massive pro-incumbency wave.",
      "summary": "Your campaign skillfully blended social justice with a strong pro-poor message. After capitalizing on the opposition's gaffe and reassuring your base, your powerful pro-poor interview set the stage for the final push. The decision to saturate the state with information about PM Modi's welfare schemes in the last 48 hours was decisive. It transformed the election into a referendum on these tangible benefits, creating a huge pro-incumbency wave among the poorest voters that swept you to a resounding victory. You have a massive mandate, built on the foundation of welfare delivery.",
      "stats": {
        "publicApproval": "66%",
        "economicOutlook": "Welfare-Driven",
        "partyCohesion": "Iron Grip",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_beneficiary_politics_victory": {
      "isEnding": true,
      "text": "You've won! The micro-management of beneficiaries on polling day ensured your victory.",
      "summary": "This was a campaign won by organization. You started with 'Social Harmony', exploited the opponent's error, and solidified your pro-poor credentials in the final debate. Your final move—a highly organized, data-driven effort to personally contact every beneficiary of central schemes—was a masterclass in modern electioneering. This micro-management ensured that your support base turned out in high numbers, delivering a solid, if not spectacular, victory. Your win is a testament to the party's organizational strength, and your position within it is now unassailable.",
      "stats": {
        "publicApproval": "58%",
        "economicOutlook": "Stable Mandate",
        "partyCohesion": "Iron Grip",
        "socialFabric": "Moderately Strained"
      }
    },
    "end_social_engineering_success": {
      "isEnding": true,
      "text": "A landmark victory! Your 'New BJP' strategy has redrawn the social map of Bihar.",
      "summary": "Your campaign was a bold and successful exercise in social engineering. You chose a 'Social Harmony' message but aggressively pursued the EBC vote after an RJD gaffe. By deliberately moving away from your upper-caste comfort zone, you risked alienating your base. However, your 'expanding the family' interview and the final whirlwind tour of EBC leaders cemented a new, powerful coalition. This has delivered a landmark victory, fundamentally changing the BJP's social composition in Bihar. You are hailed as a master strategist, but must now manage the anxieties of your old guard.",
      "stats": {
        "publicApproval": "64%",
        "economicOutlook": "Mandate for Inclusive Growth",
        "partyCohesion": "Internal Realignment",
        "socialFabric": "Shifting Dynamics"
      }
    },
    "end_risky_symbolism": {
      "isEnding": true,
      "text": "Defeat. Your overt religious symbolism alienated more voters than it attracted.",
      "summary": "Your 'New BJP' strategy to woo EBC voters was a bold one. However, the decision to personally avoid upper-caste leaders and instead visit EBC-specific temples was a critical error. The opposition and media portrayed it not as social expansion, but as cynical, divisive politics. It alienated your core upper-caste voters without fully winning the trust of the EBCs, who saw it as a last-minute gimmick. Your attempt to build a new coalition ended up pleasing no one, leading to a significant defeat. The party is now deeply divided over your failed experiment.",
      "stats": {
        "publicApproval": "43%",
        "economicOutlook": "Uncertain Mandate",
        "partyCohesion": "Blame Game",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_masterstroke_victory": {
      "isEnding": true,
      "text": "Checkmate! Your last-minute promise on the caste census was a political masterstroke that won the election.",
      "summary": "This was a high-stakes, pragmatic campaign. You started with 'Social Harmony' and pivoted to an aggressive EBC-first strategy. While risky, your final move was genius. By promising to implement the caste survey, you completely neutralized the RJD's primary weapon. This single announcement swung a massive number of EBC and OBC voters in the final 48 hours, who saw a concrete promise from a party in power. You have won a stunning victory and are being hailed as a political wizard. However, you now face immense pressure from your national leadership and core voters who are ideologically opposed to the caste census.",
      "stats": {
        "publicApproval": "62%",
        "economicOutlook": "Populist Strain",
        "partyCohesion": "Ideological Rift",
        "socialFabric": "Caste-Focused"
      }
    },
    "end_promise_fatigue_loss": {
      "isEnding": true,
      "text": "You lose. The voters saw your last-minute promise of a new ministry as just another empty pre-election promise.",
      "summary": "Your campaign's pragmatic shift towards EBC voters was a sound strategy. However, after weeks of intense political rhetoric, your final promise to create a new 'EBC Development Ministry' was met with cynicism. Voters, suffering from promise fatigue, saw it as a less credible commitment than the opposition's long-standing demand for a caste census. The move failed to create the desired swing, and you lost critical seats in EBC-dominated areas. The party is now questioning your political judgment in a campaign that was yours to win.",
      "stats": {
        "publicApproval": "45%",
        "economicOutlook": "Status Quo",
        "partyCohesion": "Internal Dissent",
        "socialFabric": "Caste-Focused"
      }
    },
    "end_knockout_punch": {
      "isEnding": true,
      "text": "A decisive victory! The corruption dossier was a knockout punch that the opposition could not recover from.",
      "summary": "Your campaign effectively combined the themes of social justice and clean governance. After pivoting from the RJD's caste gaffe back to your core message, the final release of the corruption dossier was a masterstroke. The detailed allegations, coming just 48 hours before the vote, dominated the news cycle and created a strong wave of anti-RJD sentiment. Voters chose your promise of clean governance over the opposition's tainted record. You have a strong mandate to rule and a clear directive from the public to tackle corruption.",
      "stats": {
        "publicApproval": "63%",
        "economicOutlook": "Strong Mandate for Reform",
        "partyCohesion": "Iron Grip",
        "socialFabric": "Moderately Polarized"
      }
    },
    "end_mudslinging_backfires": {
      "isEnding": true,
      "text": "Defeat in a close fight. Your final negative ad campaign was seen as desperate mudslinging and turned off undecided voters.",
      "summary": "Your campaign was on a positive track, having successfully navigated a caste controversy and pivoted to a message of clean governance. However, the decision to run a negative, caricature-based ad campaign in the final 48 hours was a fatal error. It lowered the tone of the debate and was perceived as desperate mudslinging by undecided voters, who swung to the opposition in the final moments. You lost a very winnable election, and the party is now blaming your campaign team for the ill-advised negative turn.",
      "stats": {
        "publicApproval": "47%",
        "economicOutlook": "Uncertain Mandate",
        "partyCohesion": "Blame Game",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_good_governance_win": {
      "isEnding": true,
      "text": "A victory for integrity! Your consistent focus on governance and transparency has won the day.",
      "summary": "You ran a clean, positive campaign focused on governance. After deftly handling the RJD's gaffe, you presented a clear, forward-looking agenda with your '7-Point Charter'. The final act of having all candidates sign a public pledge was a powerful symbol of your commitment. Voters, tired of corruption and caste politics, responded to this message of integrity. You have won a solid majority, not with a wave, but with a quiet vote of confidence. You have a strong mandate for reform, and the social atmosphere is relatively harmonious.",
      "stats": {
        "publicApproval": "59%",
        "economicOutlook": "Mandate for Reform",
        "partyCohesion": "Strong",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_gimmick_fails": {
      "isEnding": true,
      "text": "A narrow loss. Your 'Call Your Candidate' idea was seen as an impractical gimmick.",
      "summary": "Your campaign had the right message of governance and transparency, but the execution of your final push fell flat. After unveiling the '7-Point Charter', the 'Call Your Candidate' initiative was seen by voters and the media as a logistical nightmare and an impractical pre-election gimmick. It distracted from your core message and made your campaign look amateurish in the final, crucial hours. The opposition's more traditional ground game proved more effective, and you lost by a small margin.",
      "stats": {
        "publicApproval": "46%",
        "economicOutlook": "Status Quo",
        "partyCohesion": "Internal Dissent",
        "socialFabric": "Moderately Polarized"
      }
    },
    "end_caste_consolidation_win": {
      "isEnding": true,
      "text": "A narrow, ugly victory. The final caste-based polarization was just enough to push you across the line.",
      "summary": "You chose to fight fire with fire. After an RJD gaffe, you relentlessly pursued a strategy of caste-based polarization. Rejecting any notion of moderation, your campaign's final message was a raw appeal to caste honor. This strategy succeeded in consolidating the EBC vote to an unprecedented degree, creating just enough of a surge to win a wafer-thin majority. You have won power, but the campaign has left Bihar's social fabric in tatters, with deep resentment between communities. Governing will be incredibly difficult, and your party itself is uneasy with the extreme polarization.",
      "stats": {
        "publicApproval": "50.5%",
        "economicOutlook": "Fragile Mandate",
        "partyCohesion": "Uneasy",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_mixed_messages_loss": {
      "isEnding": true,
      "text": "Defeat. Your attempt to moderate at the last minute created confusion and cost you the election.",
      "summary": "Your campaign lacked a consistent strategy. After aggressively pursuing a caste-based line of attack, you tried to pivot back to a message of social harmony in the final 48 hours. This sent mixed signals to voters. Your core EBC targets felt you were backing down, while other communities didn't believe your sudden appeal for unity. This confusion and perceived weakness allowed the RJD to reconsolidate its base and win over undecided voters. The party is now in disarray, blaming the leadership for a fatally inconsistent campaign.",
      "stats": {
        "publicApproval": "44%",
        "economicOutlook": "Uncertain Mandate",
        "partyCohesion": "Blame Game",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_protector_of_rights_win": {
      "isEnding": true,
      "text": "You've won! Your firm guarantee to protect reservations has brought you a solid majority.",
      "summary": "Your campaign brilliantly turned an opposition gaffe into the central issue of the election. By framing the RJD's statement as a direct threat to the reservation system, you created a powerful wave of anxiety and consolidation among EBC and Dalit voters. The final, dramatic press conference where all NDA allies took an oath to protect reservations was the clincher. It positioned your alliance as the sole guarantor of social justice, leading to a comfortable victory. You have a strong mandate, but it is built almost entirely on the single plank of caste-based reservations.",
      "stats": {
        "publicApproval": "60%",
        "economicOutlook": "Status Quo",
        "partyCohesion": "Strong",
        "socialFabric": "Caste-Focused"
      }
    },
    "end_symbolic_victory": {
      "isEnding": true,
      "text": "A close victory. The final appeal using Babasaheb Ambedkar's image resonated strongly and secured key seats.",
      "summary": "Your campaign was relentless in its focus on the RJD's perceived threat to social justice. After weeks of attacks, the final advertising blitz using the image of Babasaheb Ambedkar was a powerful symbolic act. It successfully mobilized Dalit and EBC voters in several closely-contested seats, giving you a narrow but workable majority. You have won the election by positioning yourself as the defender of the constitution. However, the highly targeted, caste-centric campaign has left society polarized.",
      "stats": {
        "publicApproval": "52%",
        "economicOutlook": "Stable but Tense",
        "partyCohesion": "Stable",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_package_delivers_win": {
      "isEnding": true,
      "text": "A landslide victory! The PM's economic package, amplified by your ad blitz, swept you into power.",
      "summary": "Starting with a focus on 'Pragmatic Alliances', you successfully managed internal dissent with a show of force. The decision to bring in the Prime Minister for the final mega rally and have him announce a massive economic package was a game-changer. Your final 48-hour saturation advertising campaign ensured that every voter knew about the promised funds for Bihar's development. This created an unstoppable wave of optimism, leading to a landslide victory. You have a huge mandate and a united party, with the state's economic future looking bright.",
      "stats": {
        "publicApproval": "69%",
        "economicOutlook": "Strong Mandate for Growth",
        "partyCohesion": "Iron Grip",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_last_mile_victory": {
      "isEnding": true,
      "text": "A solid win! Your party's ground game in delivering the PM's message was flawless.",
      "summary": "Your campaign was a testament to organizational strength. After quelling an ally's rebellion, you smartly used the PM's mega rally to announce a major economic package. The real victory, however, was in the final 48 hours. Your party's ability to mobilize its cadre for a massive door-to-door campaign, explaining the package's benefits at a hyper-local level, was the decisive factor. This 'last-mile' connection ensured the message translated into votes, delivering a solid majority. Your win reinforces the importance of grassroots organization in politics.",
      "stats": {
        "publicApproval": "62%",
        "economicOutlook": "Strong Mandate for Growth",
        "partyCohesion": "Iron Grip",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_modi_wave_victory": {
      "isEnding": true,
      "text": "An absolute wave! The election became a referendum on the Prime Minister, leading to a historic victory.",
      "summary": "Your campaign correctly diagnosed that the path to victory was to nationalize the state election. After managing early alliance troubles, you brought in the Prime Minister to focus on national security and the 'double engine' narrative. Your final push to make the election a direct vote for PM Modi was incredibly successful. A massive wave of support for the PM swept across the state, decimating the opposition. You are now the Chief Minister with an enormous mandate, but your victory is seen as a reflection of the PM's popularity rather than your own.",
      "stats": {
        "publicApproval": "72%",
        "economicOutlook": "Centrally-Driven Growth",
        "partyCohesion": "Iron Grip",
        "socialFabric": "Moderately Polarized"
      }
    },
    "end_double_engine_win": {
      "isEnding": true,
      "text": "A clear victory! The 'Double Engine' argument convinced voters to choose stability and progress.",
      "summary": "Your campaign was disciplined and message-focused. You handled internal alliance issues firmly, then used the PM's rally to set up the final argument: the benefits of a 'Double Engine' government. Your comparative ad campaign in the last 48 hours, highlighting the chaos in opposition-ruled states, was highly effective. Voters chose the promise of stability and seamless Center-State cooperation. You have won a clear majority, and the alliance is stable, providing a strong platform for governance.",
      "stats": {
        "publicApproval": "61%",
        "economicOutlook": "Strong Mandate for Growth",
        "partyCohesion": "Stable",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_youth_quake_victory": {
      "isEnding": true,
      "text": "A 'Youth Quake' brings you to power! Your alliance with Chirag Paswan has captured the youth imagination.",
      "summary": "Your decision to focus on 'Pragmatic Alliances' and reward the loyal Chirag Paswan paid off handsomely. The aspirational 'Bihar First' rally positioned you and Paswan as a modern, dynamic duo. The final social media blitz, including a live Q&A, created a massive 'Youth Quake' that swung the election in your favor. Young voters, tired of old politics, voted for change. You have a strong majority, but now face the immense pressure of fulfilling the high expectations of your young electorate. Your party's old guard is also wary of Paswan's rising influence.",
      "stats": {
        "publicApproval": "65%",
        "economicOutlook": "High Expectations for Growth",
        "partyCohesion": "Internal Realignment",
        "socialFabric": "Generational Shift"
      }
    },
    "end_viral_victory": {
      "isEnding": true,
      "text": "You've won! Your campaign's viral memes and videos successfully discredited the opposition among young voters.",
      "summary": "This was an unconventional victory. Your initial focus on managing allies led you to partner closely with Chirag Paswan. The final 48-hour strategy to use memes and viral videos to mock the opposition was a risky but successful move. It made the RJD seem outdated and out of touch, driving a significant chunk of the youth vote to your camp. You have secured a comfortable majority, proving the power of modern, sometimes irreverent, digital campaigning. The party is united, but your victory is seen as being built on social media trends rather than a deep policy mandate.",
      "stats": {
        "publicApproval": "58%",
        "economicOutlook": "Mandate for Modernization",
        "partyCohesion": "Strong",
        "socialFabric": "Moderately Polarized"
      }
    },
    "end_dalit_consolidation_win": {
      "isEnding": true,
      "text": "A tactical victory! The final push with Chirag Paswan consolidated the Dalit vote and ensured your win.",
      "summary": "Your campaign was a tightrope walk. After managing Upendra Kushwaha's rebellion, you chose an aggressive Dalit-outreach strategy with Chirag Paswan. The final whirlwind tour through Dalit-majority areas was a tactical masterstroke. It led to an unprecedented consolidation of the Dalit vote behind the NDA, creating the narrow margin you needed for victory. You have won the election, but your overt focus on one community has created resentment among other groups, including some within your own alliance, leading to a polarized social environment.",
      "stats": {
        "publicApproval": "52%",
        "economicOutlook": "Stable Mandate",
        "partyCohesion": "Internal Dissent",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_balancing_act_fails": {
      "isEnding": true,
      "text": "You've lost. Your attempt to be both aggressive and moderate in the final days failed.",
      "summary": "Your campaign tried to be too clever by half. After quelling one rebellion, you launched an aggressive campaign with Chirag Paswan to woo Dalits. However, your last-minute attempt to project a moderate image with Nitish Kumar was seen as a sign of panic. The mixed messaging confused voters and diluted the impact of both strategies. The opposition successfully painted you as an opportunist. You have lost a close election, and now face a major blame game within the NDA for the strategic failure.",
      "stats": {
        "publicApproval": "46%",
        "economicOutlook": "Uncertain Mandate",
        "partyCohesion": "Blame Game",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_mahadalit_swing_win": {
      "isEnding": true,
      "text": "Victory! The emotional appeal of Jitan Ram Manjhi swung the Mahadalit vote in your favor at the last moment.",
      "summary": "Your campaign of 'Pragmatic Alliances' was put to the test, and it passed. After appeasing Kushwaha, you correctly identified the importance of Jitan Ram Manjhi. Agreeing to the Gaya rally and honoring him was crucial. The final ad campaign featuring his speech was an emotional masterstroke that swung the Mahadalit vote decisively in your favor in dozens of constituencies. This provided the margin for a comfortable victory. The alliance is cohesive, and you have a broad social mandate, although you now owe a significant political debt to Manjhi.",
      "stats": {
        "publicApproval": "59%",
        "economicOutlook": "Stable Mandate",
        "partyCohesion": "Alliance-Dependent",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_grassroots_synergy_win": {
      "isEnding": true,
      "text": "A hard-fought win! The joint door-to-door campaign in Mahadalit areas proved to be the winning strategy.",
      "summary": "Your decision to prioritize alliance management was the key to your victory. By first placating Kushwaha and then embracing Manjhi, you kept the NDA united. The Gaya rally set the stage, but the election was won in the final 48 hours with the joint HAM(S)-BJP door-to-door campaign. This synergy at the grassroots level was something the opposition could not match. It delivered a solid, hard-fought victory. Your success is a testament to your skills as a coalition manager.",
      "stats": {
        "publicApproval": "57%",
        "economicOutlook": "Stable Mandate",
        "partyCohesion": "Strong Alliance",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_welfare_contract_win": {
      "isEnding": true,
      "text": "You've won! The direct appeal to beneficiaries of central schemes has paid off.",
      "summary": "Your alliance-focused strategy proved successful. After managing internal pressures from Kushwaha and Manjhi, your decision to link Mahadalit welfare directly to PM Modi's schemes was the right call. The final bulk voice message was a direct, transactional appeal that resonated powerfully with beneficiaries. They voted to protect their benefits, delivering a clear victory for the 'double-engine' government. You have a solid mandate built on the politics of welfare delivery, but this has created a dependent relationship with the electorate.",
      "stats": {
        "publicApproval": "60%",
        "economicOutlook": "Welfare-Driven",
        "partyCohesion": "Stable",
        "socialFabric": "Moderately Strained"
      }
    },
    "end_controversial_tactic_win": {
      "isEnding": true,
      "text": "A controversial victory. Your tactics on polling day have been questioned, but you have the numbers.",
      "summary": "Your path to victory was paved with pragmatism and controversy. You managed your allies effectively, and linked your campaign to the PM's welfare schemes. However, your final tactic of setting up 'assistance' desks near polling booths has been heavily criticized by the opposition and the media as a violation of the spirit of the model code of conduct. While it may have influenced voters and contributed to your narrow victory, it has cast a shadow over your mandate. You start your term on the defensive, with your government's legitimacy in question.",
      "stats": {
        "publicApproval": "51%",
        "economicOutlook": "Contested Mandate",
        "partyCohesion": "Alliance-Dependent",
        "socialFabric": "Deeply Polarized"
      }
    },
    "end_solitary_strength_win": {
      "isEnding": true,
      "text": "A bold victory! Your decision to project the BJP as the dominant force has been vindicated.",
      "summary": "You chose a high-risk strategy. After initial attempts at alliance management, you decided to assert the BJP's dominance, snubbing allies and releasing your own, separate manifesto. The final push with full-page ads featuring only yourself was a declaration of strength. The gamble paid off. Voters, tired of coalition squabbles, opted for your promise of a strong, single-party-led government. You have won a majority, but your relationship with your NDA partners is in tatters. They feel humiliated, and your government will be a BJP-first administration with resentful allies.",
      "stats": {
        "publicApproval": "58%",
        "economicOutlook": "Strong Mandate for Growth",
        "partyCohesion": "Broken Alliance",
        "socialFabric": "Moderately Polarized"
      }
    },
    "end_organizational_victory": {
      "isEnding": true,
      "text": "Victory through strength! The party's organizational muscle delivered a win based on your solo manifesto.",
      "summary": "Your campaign was a showcase of the BJP's organizational might. After deciding to sideline your allies and project a BJP-centric vision, you relied entirely on your party's cadre. The final door-to-door distribution of your 'Sankalp Patra' was executed flawlessly, ensuring your specific promises reached every voter. This ground-level effort overwhelmed the fragmented opposition and resentful allies, delivering a solid victory for the BJP. You now have a strong mandate to implement your vision, but you will have to govern with a deeply unhappy and weakened coalition.",
      "stats": {
        "publicApproval": "60%",
        "economicOutlook": "Strong Mandate for Growth",
        "partyCohesion": "Broken Alliance",
        "socialFabric": "Moderately Polarized"
      }
    },
    "end_crusader_victory": {
      "isEnding": true,
      "text": "A crusader's victory! Your relentless focus on corruption has won you a clean mandate.",
      "summary": "You decided to make this election a single-issue fight against corruption. Sidelining allies and projecting the BJP as the sole honest alternative, your campaign culminated in the innovative 'Corruption Hotline'. This move captured the public imagination, turning the final 48 hours into a massive outpouring of public anger against the old system. You have won a landslide victory, not just for the BJP, but for the cause of clean governance. Expectations are sky-high, and your party is united, but your allies are now irrelevant and resentful.",
      "stats": {
        "publicApproval": "68%",
        "economicOutlook": "Mandate for Reform",
        "partyCohesion": "Iron Grip",
        "socialFabric": "Broadly Harmonious"
      }
    },
    "end_aggressive_win_but_polarized": {
      "isEnding": true,
      "text": "You've won, but your aggressive final push has created a tense atmosphere.",
      "summary": "Your campaign took a hardline stance, sidelining allies to focus on an aggressive anti-corruption message. The final video, with its imagery of jails and handcuffs, was a powerful but polarizing tool. It successfully mobilized your base and convinced swing voters that you were serious about cleaning up politics. You've won a clear majority on your own terms. However, the aggressive tactics have been condemned by the opposition as a threat to democracy, and you begin your term in a deeply polarized and tense political environment. Your allies, whom you ignored, are now demanding their pound of flesh.",
      "stats": {
        "publicApproval": "56%",
        "economicOutlook": "Mandate for Reform",
        "partyCohesion": "Broken Alliance",
        "socialFabric": "Deeply Polarized"
      }
    }
  }
}